sample/mm/swarm-mm-wrk-compose-c6525-25g-exp14-havail0-hori0-verti1-infi1-client1-t4-c512-d30-R500
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=500
Running 30s test @ http://10.10.1.8:8080/wrk2-api/user-timeline/read
  4 threads and 512 connections
  Thread calibration: mean lat.: 1.755ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.812ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.805ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.748ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.72ms  478.97us   3.92ms   91.88%
    Req/Sec   131.57    118.71   444.00     56.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.60ms
 75.000%    1.78ms
 90.000%    2.04ms
 99.000%    3.92ms
 99.900%    4.45ms
 99.990%    4.95ms
 99.999%    5.16ms
100.000%    5.16ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.127     0.000000            1         1.00
       1.365     0.100000          991         1.11
       1.435     0.200000         1989         1.25
       1.490     0.300000         2974         1.43
       1.543     0.400000         3974         1.67
       1.600     0.500000         4954         2.00
       1.631     0.550000         5458         2.22
       1.662     0.600000         5953         2.50
       1.697     0.650000         6448         2.86
       1.737     0.700000         6945         3.33
       1.782     0.750000         7436         4.00
       1.809     0.775000         7681         4.44
       1.843     0.800000         7937         5.00
       1.878     0.825000         8176         5.71
       1.919     0.850000         8422         6.67
       1.968     0.875000         8671         8.00
       2.002     0.887500         8795         8.89
       2.039     0.900000         8920        10.00
       2.087     0.912500         9042        11.43
       2.167     0.925000         9169        13.33
       2.305     0.937500         9291        16.00
       2.469     0.943750         9351        17.78
       2.707     0.950000         9414        20.00
       2.949     0.956250         9475        22.86
       3.109     0.962500         9537        26.67
       3.261     0.968750         9600        32.00
       3.339     0.971875         9630        35.56
       3.445     0.975000         9661        40.00
       3.553     0.978125         9693        45.71
       3.653     0.981250         9723        53.33
       3.737     0.984375         9754        64.00
       3.779     0.985938         9769        71.11
       3.839     0.987500         9786        80.00
       3.895     0.989062         9801        91.43
       3.957     0.990625         9816       106.67
       4.047     0.992188         9831       128.00
       4.091     0.992969         9839       142.22
       4.111     0.993750         9847       160.00
       4.147     0.994531         9855       182.86
       4.167     0.995313         9862       213.33
       4.211     0.996094         9870       256.00
       4.239     0.996484         9874       284.44
       4.247     0.996875         9878       320.00
       4.283     0.997266         9882       365.71
       4.327     0.997656         9885       426.67
       4.343     0.998047         9890       512.00
       4.347     0.998242         9891       568.89
       4.383     0.998437         9893       640.00
       4.407     0.998633         9895       731.43
       4.427     0.998828         9897       853.33
       4.459     0.999023         9899      1024.00
       4.487     0.999121         9900      1137.78
       4.523     0.999219         9901      1280.00
       4.535     0.999316         9902      1462.86
       4.599     0.999414         9903      1706.67
       4.631     0.999512         9904      2048.00
       4.631     0.999561         9904      2275.56
       4.731     0.999609         9905      2560.00
       4.731     0.999658         9905      2925.71
       4.895     0.999707         9906      3413.33
       4.895     0.999756         9906      4096.00
       4.895     0.999780         9906      4551.11
       4.951     0.999805         9907      5120.00
       4.951     0.999829         9907      5851.43
       4.951     0.999854         9907      6826.67
       4.951     0.999878         9907      8192.00
       4.951     0.999890         9907      9102.22
       5.159     0.999902         9908     10240.00
       5.159     1.000000         9908          inf
#[Mean    =        1.716, StdDeviation   =        0.479]
#[Max     =        5.156, Total count    =         9908]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14707 requests in 30.01s, 2.58MB read
  Socket errors: connect 0, read 0, write 0, timeout 1025
Requests/sec:    490.11
Transfer/sec:     88.07KB