sample/mm/swarm-mm-wrk-compose-c6525-25g-exp15-havail1-hori1-verti1-infi1-client1-t4-c512-d30-R500
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=500
Running 30s test @ http://10.10.1.6:8080/wrk2-api/user-timeline/read
  4 threads and 512 connections
  Thread calibration: mean lat.: 3.182ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.089ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.309ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.253ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.93ms  551.57us   4.01ms   91.99%
    Req/Sec   131.05    117.69   444.00     58.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.85ms
 75.000%    3.10ms
 90.000%    3.34ms
 99.000%    4.01ms
 99.900%   10.42ms
 99.990%   12.80ms
 99.999%   15.38ms
100.000%   15.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.113     0.000000            1         1.00
       2.517     0.100000          993         1.11
       2.615     0.200000         1988         1.25
       2.699     0.300000         3000         1.43
       2.771     0.400000         3962         1.67
       2.851     0.500000         4968         2.00
       2.889     0.550000         5445         2.22
       2.935     0.600000         5947         2.50
       2.985     0.650000         6450         2.86
       3.035     0.700000         6940         3.33
       3.095     0.750000         7428         4.00
       3.127     0.775000         7673         4.44
       3.163     0.800000         7927         5.00
       3.197     0.825000         8169         5.71
       3.241     0.850000         8419         6.67
       3.285     0.875000         8662         8.00
       3.313     0.887500         8793         8.89
       3.343     0.900000         8913        10.00
       3.379     0.912500         9040        11.43
       3.419     0.925000         9162        13.33
       3.465     0.937500         9286        16.00
       3.485     0.943750         9344        17.78
       3.515     0.950000         9406        20.00
       3.545     0.956250         9468        22.86
       3.583     0.962500         9530        26.67
       3.625     0.968750         9592        32.00
       3.647     0.971875         9622        35.56
       3.687     0.975000         9654        40.00
       3.721     0.978125         9683        45.71
       3.777     0.981250         9715        53.33
       3.827     0.984375         9745        64.00
       3.871     0.985938         9761        71.11
       3.933     0.987500         9776        80.00
       3.971     0.989062         9792        91.43
       4.069     0.990625         9807       106.67
       4.419     0.992188         9822       128.00
       4.591     0.992969         9830       142.22
       4.759     0.993750         9838       160.00
       5.247     0.994531         9845       182.86
       5.767     0.995313         9853       213.33
       7.099     0.996094         9861       256.00
       7.847     0.996484         9865       284.44
       8.083     0.996875         9869       320.00
       8.399     0.997266         9872       365.71
       8.935     0.997656         9876       426.67
       9.199     0.998047         9880       512.00
       9.319     0.998242         9882       568.89
       9.687     0.998437         9884       640.00
       9.951     0.998633         9886       731.43
      10.271     0.998828         9888       853.33
      10.431     0.999023         9890      1024.00
      10.535     0.999121         9891      1137.78
      10.559     0.999219         9892      1280.00
      10.807     0.999316         9893      1462.86
      10.991     0.999414         9894      1706.67
      11.031     0.999512         9895      2048.00
      11.031     0.999561         9895      2275.56
      11.407     0.999609         9896      2560.00
      11.407     0.999658         9896      2925.71
      11.887     0.999707         9897      3413.33
      11.887     0.999756         9897      4096.00
      11.887     0.999780         9897      4551.11
      12.799     0.999805         9898      5120.00
      12.799     0.999829         9898      5851.43
      12.799     0.999854         9898      6826.67
      12.799     0.999878         9898      8192.00
      12.799     0.999890         9898      9102.22
      15.383     0.999902         9899     10240.00
      15.383     1.000000         9899          inf
#[Mean    =        2.926, StdDeviation   =        0.552]
#[Max     =       15.376, Total count    =         9899]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14815 requests in 30.01s, 2.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 1016
Requests/sec:    493.66
Transfer/sec:     88.70KB